#!/bin/bash

# Цвета
BLUE="\033[0;34m"
GREEN="\033[0;32m"
RESET="\e[0m"

# Функция для медленного вывода строки
slow_print() {
  local text="$1"
  local delay=${2:-0.05}
  for (( i=0; i<${#text}; i++ )); do
    echo -n "${text:$i:1}"
    sleep "$delay"
  done
  echo ""
}

# Анимация баннера
clear
echo -e "$BLUE"
slow_print "     ::: ::::::::::: ::::::::::: ::::::::::: ::::::::::: :::     ::: ::::::::::: ::::::::::: " 0.001
slow_print "     :+:     :+:     :+:     :+: :+:     :+: :+:         :+:   :+:   :+:             :+:     " 0.001
slow_print "     +:+     +:+     +:+     +:+ +:+     +:+ +:+         +:+  +:+    +:+             +:+     " 0.001
slow_print "     +++     +++     +++++++++++ +++     +++ +++         +++ +++     +++++++++++     +++     " 0.001
slow_print "     +#+     +#+     +#+  +#+    +#+     +#+ +#+         +#+  +#+    +#+             +#+     " 0.001
slow_print "     #+#     #+#     #+#   #+#   #+#     #+# #+#         #+#   #+#   #+#             #+#     " 0.001
slow_print "     ###     ###     ###     ### ########### ########### ###     ### ###########     ###     " 0.001

echo -e "$GREEN"
echo "                                                                          itrocket.net"

# Добавление слогана
slow_print "Welcome aboard" 0.01


echo -e "$RESET"
